app/controllers/events_controller.rb

  def new
    if not current_user
      redirect_to '/login'
    else
      @event = Event.new
      @user = User.all
---
SELECT "users".* FROM "users"

  def create
    @event = Event.new(event_params)
    selected_day = params[:day]["day(1i)"].to_i
    selected_month = params[:day]["day(2i)"].to_i
    selected_year = params[:day]["day(3i)"].to_i
    @event["day"]= Date.new(selected_day, selected_month, selected_year)


    selected_hour = params[:time]["time(4i)"]
    selected_minute = params[:time]["time(5i)"]


    _time_ = "#{selected_hour}:#{selected_minute}"
    @event_time = _time_
    @event[:time]= _time_

    user = current_user[:id]
    @event.user_id= user
    if @event.save
---
INSERT INTO "events" ("name", "day", "place", "suggest", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", ""], ["day", ""], ["place", ""], ["suggest", ""], ["comment", ""], ["created_at", "2015-06-07 22:29:00.339857"], ["updated_at", "2015-06-07 22:29:00.339857"]]

  def destroy
    @event=Event.find_by(params[:id])
    @event.delete
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]