app/controllers/home_controller.rb

SELECT  "events".* FROM "events"  ORDER BY "events"."id" DESC LIMIT 1
SELECT  "users".* FROM "users" WHERE (1) LIMIT 1
---
  def home
    @events = Event.all
    @users = User.all